[
// Spectator
	{
		"name": "Spectator",
		"outerColor": [255,255,255]
	}
	,
	//Barbarian
	{
		"name": "Barbarians",
		"outerColor": [0,0,0],
		"innerColor": [185,10,10],
		"style": "Barbarians",
		"uniques": ["Can only heal by pillaging", 
					"[Recon] units gain the [No Suicide] promotion", 
					"[Sword] units gain the [No Suicide] promotion", 
					"[Gunpowder] units gain the [No Suicide] promotion", 
					"[Anti-Cav] units gain the [No Suicide] promotion", 
					"[Armored] units gain the [No Suicide] promotion", 
					"[+15]% Strength <within [1] tiles of a [Barbarian encampment]>"]
	}
	,
	
// Nations
	
	// The Empire
	{
		"name": "Reikland",
		"leaderName": "Emperor Karl Franz",
		"adjective": ["Reiklanders"],
		"startBias": ["Fresh Water", "Forest"],
		"preferredVictoryType": "Diplomatic",
		"personality": "God-Emperor",
		"favoredReligion": "Cult of Sigmar",
		"style": "Human",
		
		"startIntroPart1": "The Empire is the strongest, wealthiest and most famous realm in the Old World. Made up of independent provinces and city states, the Empire is ruled over by Elector Counts and the ultimate power; the Emperor Karl Franz. The Emperor's powerful armies form the bastion that keeps the marauding Orcs and forces of Chaos from overrunning the Old World.",
		//"startIntroPart2": "...",
		
		"declaringWar": "Now, we unite! To purge the evil that dare confront us! Follow me, and we will banish this darkness! I swear this as your Emperor!",
		"attacked": "In the centuries I have been High King, our enemies have thought us weak, cowards hiding in the deepest, darkest places. Fools! Every wrong is recorded. Every slight against us, page after page, etched in blood! Clan Gurnisson! Karak Eight-Peaks! Josef Bugman!",
		"defeated": "We die wielding our swords, for there is no better death for a warrior.",
		"afterPeace": "Be at peace, for that is all I ever want.",
		"introduction": "I am Karl Franz, and I was born into this world, just like you.",
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"outerColor": [204, 0,0],
		"innerColor": [255,255,255],
		//"uniqueName": "Valley of Rejuvenation",
		//"uniqueText": "+1 Population to all cities settled on Fresh Water \nAll Land-Military units gain the Amphibious promotion \n-33% tile improvement construction time in River tiles",
		"uniques": ["[-33]% construction time for [All] improvements <in [River] tiles>",
					"Starts with [Old World]",
					"[+25]% Strength <vs [Beast] units>",
					"Notified of new Barbarian encampments",					
					"[{Military} {Land}] units gain the [Drill] promotion"], 
		"cities": ["Altdorf","Kemperbad","Eilhart","Ubersreik","Helmgart","Castle Reikguard","Dunkelberg","Diesdorf","Frederheim","Glumund",
			"Gluckshalt","Holthusen","Bögenhafen","Grünburg","Tallerhof","Stromdorf","Schädelheim","Prie","Stimmigen","Schluesselschloss",
			"Schloss Drakenburg","Schilderheim","Rottfurt","Zahnstadt","Wittgendorf","Wörlin","Wheburg","Weissbruck"],
		"spyNames": ["Emmanuel Blanck","Agilwardus Kerche","Burgolf von Stimminge","Leon Einaugen","Hannes Herbort Kempster von Delbert","Herdeinus Telfair","Theodosius Hahn"],
		"civilopediaText": [
			{"text": "When the High Elves left their great towers in the Old World, the land was abandoned to the Orcs, Goblins and savage Human tribes. In those distant times, the fathers of Men were nothing but fur-clad savages, barely distinguishable from Orcs in the eyes of the haughty Elves. It was the Dwarfs who recognised the potential of Humanity, first as trading partners, but eventually as allies against the Orcs that infested the land."},
			{"text": "The [Dwarfs] taught the Human tribes the secrets of metallurgy and swordmaking and, as a result of trade and further Dwarf encouragement, primitive Men began to grow in strength and ambition. "},
			{"text": "The many Human tribes remained divided until the time of Sigmar, the founder of the Empire and friend of the Dwarf king Kurgan Ironbeard. It was Sigmar who rescued Kurgan from the Orcs, and in honour of this valiant act the Dwarf king gave him the great warhammer Skull Splitter. For ever after the Emperor was known as Sigmar Heldenhammer and was accounted a true friend of the Dwarfs, the greatest honour a Dwarf can bestow. Sigmar united all the warring Human tribes under his rule and established the realm that is known today as the Empire."},
			{"text": "Sigmar's day was over two thousand years ago and since that time the Empire has survived many long and arduous wars. It has suffered Orc and Goblin invasions, the devastations of the Vampire Counts, and the dreaded incursions of Chaos armies. It has also endured periods of rebellion and anarchy within its own borders."},
			{"text": "In all that time there have been many weak and disastrous Emperors, such as Boris Goldgather, and also many great conquerors, such as Magnus the Pious."},
			{"text": "Despite times of changing fortune, even during its long periods of disunity and division, the Empire has always maintained its sense of identity as one land and one people, under the spiritual, if not actual, leadership of Sigmar, who is now accorded the status of patron god of his ancient realm."},
			{"text": "Today the Empire is the largest and most powerful of all the lands of Men. It stretches from the Grey Mountains and the borders of Bretonnia in the south to the Forest of Shadows and the land of Kislev in the north. Eastwards it is bounded by the Sea of Claws and the wilderness known as the Wasteland. Westwards the borderlands lie upon the foothills of the World's Edge Mountains."},
			{"text": "Within the Empire's boundaries lie dark forests, mighty rivers and tall, forbidding mountains. For the most part these are wild and untamed, the refuge of evil creatures and brigands of all kinds. The real strength of the Empire lies in its sprawling cities and the lesser towns and farms that lie under their protection."},
			{"text": "The Empire is a great commercial as well as military power, whose cities prosper in a new age of enlightenment and growth. In the busy markets, rich merchants jostle with scholars, and dour warriors rub shoulders with skilled artisans. In the deep harbours of Altdorf, ocean-going ships unload cargoes from all over the world. Altdorf is also the home of the Colleges of Magic, the foremost schools of sorcery in the Old World, and of the Imperial Zoo, which maintains a stable of many fantastic monstrous creatures."},
			{"text": "The Emperor's armies come from the widespread lands of the Empire. As well as sturdy infantry and heavily armoured knights, the Emperor can call upon the marvellous inventions of the Engineers. These are men taught in the traditions of the Dwarf smiths by Dwarf refugees driven from their mountains and now settled in the Empire under the Emperor's protection. Huge cannons are forged in the city of Nuln, whilst ambitious inventors work away at engines powered by steam or alcohol and devices driven by clockwork."},
			{"text": "Mankind has grown and prospered greatly since the decline of the Dwarfs and Elves. From humble beginnings Men have raised mighty nations to equal the civiliations of the older races. The greatest of these nations is the Empire, a land which stands upon the dawn of a new age of exploration and discovery. However, the growth and even survival of the Empire is by no means certain, for there are many perils that threaten its future, not least of which is the growing shadow of Chaos in the north. Such perils must be faced and overcome if Mankind is to flourish. But the greatest danger lies within, for even inside the Empire there are those who seek the aid of the Dark Gods of Chaos, who would trade the freedom of Man for a brief taste of power. Indeed, the witch hunters of the Emperor are kept almost as busy as the soldiers of its armies."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
		
	},
	// Bretonnia
	{
		"name": "Bretonnia",
		"leaderName": "Gilles Le Breton",
		"adjective": ["Bretonnians"],
		"preferredVictoryType": "Diplomatic",
		"personality": "Royarch",
		"favoredReligion": "Lady of the Lake",
		"style": "Human",
		"outerColor": [0, 0, 204],
		"innerColor": [255, 255, 255],

		"declaringWar": "The knightly sons of Bretonnia ride to war once more, in pursuit of honour, glory, and land!",
		"attacked": "When the clarion call is sounded, I will ride out and fight in the name of liege and Lady, Whilst I draw breath the lands bequeathed unto me will remain untainted by evil. Honour is all. Chivalry is all.",
		"defeated": "In the time of Bretonnia's greatest need, when it seems that all hope is gone, I shall return to aid you..",
		"afterPeace": "Be at peace, for that is all I ever want.",
		"introduction": "By the will of the Lady of the Lake, beneficent deity of all Bretonnia, I welcome you.",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		

		"uniques": ["Starts with [Knightly Virtues]",
					"When defeating a [Preachable] unit, earn [0] Gold and recruit it <with [25]% chance>"], 
		"cities": ["Couronne","L'Anguille","Gisoreux","Mousillon","Lyonesse","Bordeleaux","Bastonne","Quenelles","Brionne","Parravon","Lisounne","Montfort","Aquitaine","Artois","Vecreaux","Gaon","Chalons","Oisillon","Alencon","Poussenc","Montluc","Perrache","Jouinard","Vettard","Chambonnay","Carcassonne","Cuilieux","Glanborielle","AubeTilea","Brusse","Yremy","Cixous","Larret","Clouseau","Brusse","Moutiers","Saint Leu","Antoch","Ferignac","Marguilles","Cavour"],
		"spyNames": ["Raymondin de Gaucourt","Simon le Cordelier","Gunnor d'Espernon","Guillemette l'Extrac","Gracien de Tuillieres","Charles Marchant","Ermentrudis de Louviers"],

		"civilopediaText": [
			{"text": "Bretonnia lies between the Grey Mountains and the Great Ocean in the lands which comprise part of the former domain of the Elves. The Elves once built ports and tall towers, palaces and pinnacles, to serve their colonies in Old World. For a while they prospered, their cities grew, and the inhabitants became wealthy as a result of trade with the Dwarfs and primitive Human tribes. When the Elves and Dwarfs went to war, the land was devastated by the opposing armies. Eventually, after many long years of fighting, the Elves sailed back into the west and abandoned the Old World altogether. The Dwarfs too gave up on the land beyond the mountains, and so the whole area was deserted and forgotten."},
			{"text": "With the disappearance of the Elves and [Dwarfs], the land was quickly overrun by Orcs, Goblins and the rough Human tribes who were almost as brutal in those far off days. For many hundreds of years the area remained divided between rival warlords, both green-skinned and Human, until the time of Gilles of the tribe of Bretonni. In his day the realm was united, and as one nation the Bretonnians succeeded in defeating and driving out the Orcs and Goblins. It is from this time that the Bretonnians date the creation of their kingdom, some 977 years after the time of Sigmar and the founding of the Empire. "},
			{"text": "To this day the Knights of Bretonnia follow the chivalric traditions established in the time of Gilles le Breton. Gilles' vision of the Lady of the Lake on the eve of battle foretold of his holy purpose and ultimate destiny as king of Bretonnia. Since then the warriors of Bretonnia have pledged themselves to the service of the Lady of the Lake, and sought to uphold the knightly virtues in her name. By feat of arms a Knight may rise in esteem and become, by degrees, one of those marked by the goddess for her special honour. That reward is to drink, as Gilles le Breton once drank, from the Lady's Grail, as only those who are pure in heart and deed can do."},
			{"text": "Bretonnia has grown into a powerful nation under the guidance of its king, the Lady of the Lake, and the code of honour under which its nobility conducts itself in peace and war. There are no other men whose martial prowess can equal the Knights of Bretonnia, dedicated as they are, body and soul, to the pursuit of excellence. Indeed, it is often said that the Knights of Bretonnia could conquer the world were it not for their vows which bind them to protect their own domain and shield the poor and innocent from unwarranted hostility."},
			{"text": "Though a Knight's code of honour binds him to the protection of his land and people, there are still times when he finds himself bound for war in foreign lands. When the Sultan Jaffar of Araby invaded the lands of Estalia, the king of Bretonnia, at that time Louis the Righteous, raised a mighty army pledged to free Estalia from his evil grasp. During the Crusades which followed not only was Estalia freed but the Bretonnian king took the war to Araby itself and destroyed the empire of Jaffar. Filled with crusading zeal the Knights tore down the decadent palaces of the Sultan, burned many evil tomes from his library, and flung down the dark idols from his unholy temples."},
			{"text": "Today the king of Bretonnia and his Knights form a bulwark against the growing evils of Chaos and the power of the Orcs, Goblins, Skaven and other monstrous creatures that threaten Mankind's survival. The Bretonnians are protected by their honour and by their strength of arms and, whilst they endure, the lands of Men remain safe from peril. If the Knights of Bretonnia were ever to fail in their sacred duties, then the Human race would surely be doomed."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]

	}
	,
	// Dwarfs
	{
		"name": "Dwarfs",
		"leaderName": "High King Thorgrim Grudgebearer",
		"adjective": ["Dwarfs"],
		"startBias": ["Hill"],
		"favoredReligion": "Ancestor Gods",
		"preferredVictoryType": "Scientific",
		"personality": "Monarch",
		"style": "Dwarven",
		"outerColor": [86, 151,216],
		"innerColor": [255,255,255],

		"declaringWar": "Hi ho hi, it's off to war we go...",
		"attacked": "Not that I have anything against senseless violence, manling, but why exactly are you strangling that old man?",
		"defeated": "No Rest until the Blood of Greenskins flows like Dark Ale upon the Earth!",
		"afterPeace": "We sons of Grungni may have drunk deep from the bitter waters of misfortune, but we yet survive. Whilst a single Dwarf draws breath, we will fight the evils that assail us, and we will never, ever give up.",
		"introduction": "Revere the ancestors, obey your king, bear your arms with pride, fear no foe, hate the Greenskin, mistrust the Elf, and you can do no wrong.",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Dwarven Ingenuity]",
			"Comment [Dwarven]",
			"[+10]% Strength <within [2] tiles of a [Mountain]>", 
			"Earn [50]% of killed [Ironclaw Orcs] unit's [Cost] as [Gold]",
			"Earn [50]% of killed [Badmoon Goblins] unit's [Cost] as [Gold]",
			"Units ignore terrain costs when moving into any tile with Hills",
			"Land units may cross [Mountain] tiles after the first [Great Person] is earned",
			"Comment [Units ending their turn on [Mountain] tiles take [15] damage]"],
		"cities": ["Karaz-a-Karak","Barak Varr","Karak Angazhar","Karak Azgaraz","Karak Bhufdar","Karak Eksfilaz","Karak Gantuk","Karak Grom","Karak Hirn","Karak Izor","Karak Kadrin","Karak Kaferkammaz","Karak Norn","Karak Ziflin","Zhufbar","Karak Azul"],
		"spyNames": ["Rogir Greathelm","Dudduh Steelchaser","Zurgalbard Firefoot","Skigrom Goldenaxe","Khoaged Stoutshaper"],

		"civilopediaText": [
			{"text": "The Dwarven Kingdom of old was prosperous and full of splendor and glory. The majority of the Dwarven strongholds have fallen, one by one, in the bitter wars with the Orcs, Goblins or Skaven, even now the remaining few Dwarf cities are under constant siege. These centuries of war have hardened the Dwarfs and moulded them into some of the finest warriors of the Old World. Always a stubborn race, the Dwarfs still cling to what remains of their Kingdom, and dream of one day reclaiming their own (and extracting a terrible vengeance!)"},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]

	},
	// Tomb Kings (Khemri)
	{
		"name": "Khemri",
		"leaderName": "Settra the Imperishable",
		"adjective": ["Tomb Kings"],
		"startBias": ["Desert"],
		"style": "Demonic",
		"favoredReligion": "Nehekharan Pantheon",
		"outerColor": [255, 205,0],
		"innerColor": [0,0,0],

		"startIntroPart1": "The Tomb Kings know nothing but rage and the desire to reclaim their lost kingdoms.",
		//"startIntroPart2": "...",
		
		"declaringWar": "Lightning shall sunder the skies, the rivers will flow with blood and war will come to the land. The legions once more rise in eternal conquest...And death shall ride beside them.",
		"attacked": "Damnation awaits those who would disturb our rest! Here be the souls of those that are lost...",
		"defeated": "This death is ours. We choose it. We deny you your victory.",
		"afterPeace": "You'll live a bit more then.",
		"introduction": "Hello living people. Sooner or later, you'll be part of us.",	
		
		"neutralHello": "We can be friends forever.",
		"hateHello": "I see dead people.",
		"tradeRequest": "What are you willing to offer for eternity?",
		
		"uniques": ["Starts with [Undead Curse]",
					"Free [Skeletal Warrior] appears <upon founding a city> <before the [Feudal age]>", 
					"Free [Skeletal Champion] appears <upon founding a city> <starting from the [Feudal age]>",
					"Gain a free [Burial Tomb] [in annexed cities]"],
			"cities": ["Khemri","Zandri","Numas","Quatar","Bhagar","Lybaras","Rasetra","Zartek","Shurak","Asur","Samur","Kehbet","Sahkra","Laharaz","Axul","Kabahta","Kharba","Urukh","Rakashur","Tamlak","Tephis","Mezzareh","Axular","Isis","Neftis","Dinaz","Amhis","Bakhutan","Mutash","Tiftis","Shar"],

		"civilopediaText": [
			{"text": "The ancient realm of Nehekhara was once the greatest civilisation of Men in the world, but hundreds of years before the rise of Sigmar the treachery of the Great Necromancer, Nagash, almost destroyed and enslaved this mighty realm. Brought back to immortal unlife by arcane magic, the Tomb Kings of Nehekhara continue to lead their Undead armies, fighting to protect their mighty empire from the depredations of the lesser races and expand their dominion even further."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
		
	},
	// Kislev
	{
		"name": "Kislev",
		"outerColor": [105, 34,0]
		"leaderName": "Tzarina Katarin Bokha",
		"adjective": ["Kislevites"],
		"personality": "Monarch",
		"startBias": ["Tundra"],
		"style": "Human",
		"outerColor": [204, 255,255],
		"innerColor": [0,0,0],

		"startIntroPart1": "For generations, the sons of Kislev have fought and died on the barren plains of the far north.",

		"declaringWar": "You're slow. We're fast.",
		"attacked": "Today we fight for Kislev! Today we fight for her lost sons and daughters, for her proud mothers and fathers!",
		"defeated": "You will die, like your weakling father died. Soulless. Honorless. Weeping. Ashamed.",
		"afterPeace": "Never trust a man who is afraid to lose his temper.",
		"introduction": "Ursun woke me to keep this world safe. I intent to do so!",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Old World]",
					"Gain [250] [Gold] <upon conquering a city>", 
					"[+1] Movement <for [Military] units> <when at war>", 
					"[+1] Sight <for [{Military} {Land}] units>", 
					"May buy [Shrine of Ursun] buildings with [Faith] [in all cities]"
					"Provides [3] [Horses]"],
		"cities": ["Kislev","Praag","Erengrad","Volksgrad","Belev","Kobrin","Krakjunov","Bolgasgrad","Patragresk","Preslav","Rakhov","Omensk","Zilair","Gdov","Chazask","Pinsk","Murmagrad","Dubna","Egorevsk","Oolnza","Nyrob","Yaransk","Tzeskagrad","Krovas","Shatsk","Selkov"],

		"civilopediaText": [
			{"text": "The land of Kislev lies to the north and east of the Empire. As one travels eastwards the dense forests give way to open steppes stretching to the foothills of the World Edge Mountains. Beyond these formidable peaks lie barren wastes inhabited by tribes of greenskins of which the wolf-borne Hobgoblin hordes are the most numerous. To the north lies the desolate boulder-strewn Troll Country and beyond regions blighted by Chaos. It is said that in Kislev the winters are long and harsh, snow lies deep over the land and enemies are never far away."},
			{"text": "Kislevites are savage and uncouth then this is hardly surprising given the dangers that surround them. Throughout its history Kislev has been beset by terrible foes, Chaos to the north, Hobgoblins to the east, and Orcs and Goblins from the Worlds Edge Mountains."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
		
	},
	// Vampire Counts (Sylvania)
	{
		"name": "Sylvania",
		"leaderName": "Count Mannfred von Carstein",
		"adjective": ["Sylvanians"],
		"outerColor": [255, 255,255],
		"innerColor": [0,0,0],

		"startIntroPart1": "'This land is my home, my birthright. The wind and rain are my allies. The trees and stones are my foot soldiers. The very earth will rise up against you should you try to take it from me. And my people will feast on your bones.' - Mannfred von Carstein, the Lord of Sylvania",

		"introduction": "Please, come in and join me for dinner. I can see from the way you dress, you are a man of exquisite... taste.",
		"declaringWar": "Surrender and serve me in life, or die and slave for me in death.",
		"attacked": "It will be a bloodbath. How delicious.",
		"defeated": "Mark my words, they'll get us all in the end.",
		"afterPeace": "Let's have a banquet to celebrate.",
		
		"neutralHello": "You have my *eternal* gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		

		"uniques": ["Starts with [Undead Curse]",
			"May buy [Vampire] units for [100] [Faith] [in all cities] at an increasing price ([25]) <starting from the [Feudal age]>",
			"Provides [4] [Vampiric Block]", 
			"[{Military} {Land}] units gain the [Vampiric Touch] promotion",
			"New [Vampire] units start with [-15] Experience [in all cities]"],
		"cities": ["Drakenholf","Waldenhof","Swartzhafen","Leicheberg","Tempelhof","Nachthafen","Mikalsdorf","Naubonum","Thyrnau","Telfeuheim","Essenfurt","Stephansdorp","Egling","Rottfurt","Pfaffbach","Regrakhof","Siegfriedhof","Vanhaldenschloss","Vermisace","Dunkelburg","Rottefach","Grachling","Murringen","Miesenthal","Trutzeburg","Grabstatt","Motteburg","Griemeling","Moderholm"],

		"civilopediaText": [
			{"text": "The Vampire Counts are the immortal rulers of the evil Undead. Powerful and cruel beyond the comprehension of the living, they command armies of decaying Zombies, Skeletons, Wights and Ghouls to destroy the Old World. When a Vampire Counts army goes to war, entire graveyards give up their dead as the spirits of the fallen take up arms once more to fight under their unliving masters."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
		
	}
	,
	// High Elves (Ulthuan)
	{
		"name": "Ulthuan",
		"leaderName": "Aenarion",
		"adjective": ["High Elves"],
		"startBias": ["Coast"],
		"favoredReligion": "Elven Gods",
		"personality": "Warborn",
		"style": "Elven",
		"outerColor": [5, 164, 167],
		"innerColor": [255,255,255],
		
		"declaringWar": "The Gods demand your death.",
		"attacked": "For five thousand years we have defended our shores from all who would conquer us. You shall not pass!",
		"defeated": "I am offering myself as a sacrifice to save my people when the gods have rejected all others.",
		"afterPeace": "We embrace a new future.",
		"introduction": "I am Aenarion the Defender, the blessed Phoenix King of Asuryan. We, the Asur, are a noble people, our long and proud history stretching back to a time when Men were still fur-clad savages.",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Channeling]",
					"Enables embarkation for land units <starting from the [Ancient age]>", 
					"Enables [All] units to enter ocean tiles <starting from the [Age of Magic]>",
					"Defense bonus when embarked <for [All] units>",
					//"[+10]% Strength <vs [Naggaroth] units>", // the old enemy
					"Comment [Elven]"],
		"cities": ["Avelorn","Phoenix Gate","Gaen Vale","Griffon Gate","Ellyrion","Eataine","Caledor","Saphery","Yvresse","Cothique","Chrace","Nagarythe","Tiranoc"],

		"civilopediaText": [
			{"text": "'Though our fair homeland is beset on all sides, we shall resist, as our forefathers did before us. In these dark times, as our tainted brethren ravage our shores, we stand defiant and shall emerge victorious. For we are the Asur, the true kin of Aenarion, and Ulthuan shall never fall.' - Prince Tyrion, Defender of Ulthuan"},
			{"separator": true},
			{"text": "An ancient and noble race, the High Elves have refined their martial skills and magical prowess over the centuries. As the uprimitive tribes of Man fought amongst themselves, the High Elves navigated the oceans and mapped the heavens. They have watched empires rise and fall, and ferociously repel all who seek to conquer their homeland."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "In Warhammer world map, Ulthuan can use the benefit of being isolated until other nations discover Compass. Apart from Naggaroth, your island territory rather protected from whatever war you're in."},
			{"text": "Use sea elfs to quickly contact other nations, then Espionage to send a few spies and keep in pace of technologies."},
			{"text": "Feel free to raid the new world while you're gradually building up your land."},		]
	}
	,
	// Wood Elves (Loren)
	{
		"name": "Loren",
		"leaderName": "Ariel",
		"adjective": ["Wood Elves"],
		"startBias": ["Forest","Avoid Hills","Avoid Coast"],
		"style": "Elven",
		"favoredReligion": "Elven Gods",
		"outerColor": [34, 139, 34],
		"innerColor": [240, 255, 240],
		
		"attacked": "Athel Loren shall not suffer the presence of Men, nor Orcs, nor Dwarfs, nor Beastmen. If a foe takes a single step upon such sacred soil, they shall not take another.",
		"declaringWar": "You've been charged with tree-cutting. This is war.",
		"defeated": "The woods will still whisper!",
		"afterPeace": "Let's spread the flowers of peace.",
		"introduction":"I wish your kind would find your proper place in the world, then all would be better.",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "All the branches you break, the leaves and vines you tread on, will rise up in anger and punish you for your insolence.",
		"tradeRequest": "I offers you this exceptional proposition.",
		

		"uniques": ["Starts with [Forest Mastery]",
					"Comment [Cannot [Remove Forest] except by Great Improvement]", 
					"Comment [Cannot build [Lumber mill] improvement]", 
					"Comment [May build [Plantation] improvement without removing Forest]", 
					"Comment [May build [Mine] improvement without removing Forest]", 
					"Comment [May build [Quarry] improvement without removing Forest]", 
					"Comment [May build [Farm] improvement without removing Forest]", 
					"Comment [May build [Pasture] improvement without removing Forest]", 
					"[+1 Culture, +1 Faith, +1 Food] from every [Forest] <with [3] to [6] neighboring [Forest] tiles>", 					
					"[{Military} {Land}] units gain the [Woodelf] promotion",
					"[+15]% Strength <in [Forest] tiles> <for [All] units>",
					"[-15]% Strength <in [Fallout] tiles> <for [All] units>",
					"[-15]% Strength <in [Desert] tiles> <for [All] units>",
					"[-15]% Strength <in [Snow] tiles> <for [All] units>",
					"Comment [Elven]"],
		"cities": ["Athel Loren","Tor Lithanel","Torgovann","Cavaroc","Atylwyth","Cythral","Modryn","Talsyn","Wydrioth","Fyr Darric","Anmyr","Tirsyth","Arcwylon","Arranoc"],

		"civilopediaText": [
			{"text": "Long ago the High Elves abandoned their cities in the Old World to return to their island home of Ulthuan. Some, however, stubbornly stayed, unwilling to leave their forest behind. These are the ancestors of the Wood Elves, who still live in the enchanted forest of Athel Loren. Having tamed the wild beasts and befriended the strange Treemen and Dryads, a Wood Elf army is unlike any other. Adapting well to their surroundings, the Wood Elves have developed many new troop types ideal for protecting their land. To this day the sacred forest of Athel Loren has never been conquered."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Estalia
	{
		"name": "Estalia",
		"leaderName": "Don Jose Paul",
		"adjective": ["Estalians"],
		"style": "Human",
		"personality": "Monarch",
		"favoredReligion": "Cult of Myrmidia",
		"outerColor": [209, 106, 10],
		"innerColor": [0,0,0],
		
		"declaringWar": "Our mother of battle, she who keeps our blades keen, who keeps our shields ready, and our armour strong, grant us the grace to know our enemies, and the honour to stand against them, and the strength to defeat them.",
		"attacked": "I will parry your prima attacks on my three-quarters radial, and take zeh high ground. With just a fifty-three inch reach, you can't win this fight using a cutting blade. Not with such a poor stance, senor.",
		"defeated": "God was real, and he hated us.",
		"afterPeace": "The sword is not the answer to every military problem, for even the mightiest of swords will miss its mark if the opponent is wise enough not to wait around to get slain.",
		"introduction": "Hola, we're Estalians. We'd love duelling with you.",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Old World]"],
		"cities": ["Magritta","Bilbali","Aguilas","Ubrique","Geulata","Larhgoz","Belmoz","Zaragoz","Vizeaya","Astorias","MonteTilea","Borgas","Graus","Muros","Ubrique","Los Cabos","Barboza","Almyria","Pajena","Javea","Almagora","Cebreros","Potes","Sitges"],

		"civilopediaText": [
			{"text": "Estalia is a hot, barren peninsula located west of Tilea and Bretonnia. Being isolated by water and the Abasko Mountains, Estalian people have little or no contact with the rest of the Old World. They live in constant struggle to keep their settlements alive. Skaven, orcs and goblins - all raid the area regularly, giving the Estalians no time to rest. Their greatest struggle came when the Sultan of Araby invaded the region at the suggestion of the Skaven. However, the other nations of Men in the Old World rallied to defend the Estalian people, and their sovereignty was preserved."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Tilea
	{
		"name": "Tilea",
		"leaderName": "Borgio",
		"adjective": ["Tileans"],
		"style": "Human",
		"personality": "Monarch",
		"favoredReligion": "Cult of Myrmidia",
		"outerColor": [196, 182, 76],
		"innerColor": [178, 0, 0],


		"declaringWar": "Ey stupido. You're weak.",
		"attacked": "De smarta-alek words for our castillos is dat dey remain a treat to communications. Dis is right. Anda iffa you don't get the letters from home, howa you gonna know how your mama is?",
		"afterPeace": "A small gesture can change destiny.",
		"defeated": "We're wava the white flag!",
		"introduction": "There issa plenty of mercenaries in our lands. Use dem or dey may killa you.",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Old World]"],
		"cities": ["Remas","Tobaro","Luccini","Miragliano","Pavona","Sartosa","Trantio","Verezzo","Monte Castello"],

		"civilopediaText": [
			{"text": "Tilea stretches from the Appucini Mountains in the east to the Abasko Mountains in the west, curving around the Tilean sea and bordered by the Irrana Mountains in the north. The Apucinis shelter the Tileans from the lawless areas known as the Border Princes, or that is how the Tileans see it, at least. But the forest and the foothills are dangerous, harbouring many predatory beasts, not all of natural or earthly origin. There are Goblins, and brigands are a constant threat, maintaining strongholds high in the mountain valleys. Few Tileans would willingly travel into these areas, and few of those who do ever return. The inland states are mostly agricultural, growing crops and raising goat and sheep herds or grazing cattle. To the west, the Abasko Mountains reach right down to the sea, offering little room for settlement other than small fishing villages and a few goat-herding settlements high up in one of the hidden valleys."},
			{"text": "In the northwest lies the foul Blighted Marshes, a lifeless area of shallow pools covered by a great swirling mist of foul gases and fed by innumerable stinking streams. The Marshes form countless miles of fetid, sluggish pools in which indescribable things slime and slither, it is a lightless land of mist and foul vapour, so repellent that humans avoid the area. The Marshes are home to pestilence and countless disease-carrying insects, but also to the arch-servants of Chaos, the Skaven, whose great monument to decay, the city of Skavenblight, stands crumbling amongst the stinking mire. The few that dare breath the city's name insist that it is but an evil legend."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Norsca
	{
		"name": "Norsca",
		"leaderName": "Ragnar",
		"adjective": ["Norsemen"],
		"startBias": ["Tundra"],
		"style": "Icemen",
		"outerColor": [128, 56, 167],
		"innerColor": [0,0,0],
		
		"declaringWar": "We, most favoured of the gods, shall burn your lands, revel in your suffering, and destroy you. ",
		"attacked": "Blood for the Blood God!",
		"defeated": "Alas, now I am taking my father's hand.",
		"afterPeace": "Is it the beginning of the end?",
		"introduction": "The gods compel us to murder, but I do it freely!",
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		

		"uniques": ["Starts with [Norse Tradition]",
					"[+2 Food, +2 Production] in cities on [Land] tiles <with [1] to [6] neighboring [Tundra] tiles>",
					"Receive triple Gold from Barbarian encampments and pillaging Cities"],
		"cities": ["Skjold","Skraevold","Vinnskor","Aeslings","Bjornlings","Sarls","Graelings","Vargs","Skaelings","Baersonglings","Wyrmkin","Wolfclaw","Stormravens","Sortsvinaer"],

		"civilopediaText": [
			{"text": "'This cold land north of the Empire is the home of the fierce Vikings. It is a land of mountains, forests and snow, with few habitable places. People born here in this inhospitable land grow up tough or not at all. The mountains have permanent snow caps, and narrow fjords reach into the heart of the country, burrowing through the mountains, creating imposing views of breathtaking beauty. But the view is not the only thing that'll take your breath away. Here you'll find blood thirsty Trolls and Ogres, Giants and Goblins, all ready to take your life, given half a chance.' - excerpt from a lecture by Hans Furcht, Professor at the Zauber Entstellung, Altdorf"},
			{"text": "Norsca is inhabited mostly by barbaric human tribes and dwarfs. They spend their whole lives drinking and fighting. Norsemen are known for their longships, horned helmets and considerably large population of giants"},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Dark Elves (Naggaroth)
	{
		"name": "Naggaroth",
		"leaderName": "Witch King Malekith",
		"adjective": ["Dark Elves"],
		"startBias": ["Tundra"],
		"style": "Elven",
		"favoredReligion": "Cult of Khaine",
		"outerColor": [153, 51, 153],
		"innerColor": [0,0,0],
		
		"declaringWar": "We will never forget that which has been taken from us. Ulthuan belongs to me. If it takes a thousand years, ten thousand years, I will claim my rightful place as king. I am the son of Aenarion. It is my destiny.",
		"attacked": "We shall strike down our foe with sharp steel and cold hearts. The weak die so that the strong shall be spared. Then and only then will our enemies know the true meaning of fear.",
		"defeated": "No... I have only begun.",
		"afterPeace": "Next time all of Ulthuan will be ours. Next time we will succeed. Next time victory will be inevitable.",
		"introduction": "I am Malekith! Son of Aenarion, the daemons’ bane. Hear my name and know me, the rightful king of the elves!",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["[+2 Food, +1 Production] in cities on [Land] tiles <with [1] to [6] neighboring [Tundra] tiles>", 
					"Free [Settler] appears <upon discovering [Calendar] technology>", 
					"Free [Warrior] appears <upon constructing [Courthouse]> <upon discovering [Warrior Caste] technology>", 
					"Free [Swordsman] appears <upon constructing [Courthouse]> <upon discovering [Iron Working] technology>",
					"Free [Longswordsman] appears <upon constructing [Courthouse]> <upon discovering [Steel] technology>",
					"Free [Musketman] appears <upon constructing [Courthouse]> <upon discovering [Gunpowder] technology>",
					"Free [Rifleman] appears <upon constructing [Courthouse]> <upon discovering [Rifling] technology>",
					"Free [Infantry] appears <upon constructing [Courthouse]> <upon discovering [Replaceable Parts] technology>",
					"Free [Lightsaberman] appears <upon constructing [Courthouse]> <upon discovering [Lasers] technology>",
					"Comment [Elven]"], 
		"cities": ["Naggarond","Ghrond","Karond Kar","Har Ganeth","Hag Graef","Clar Karond","Har Kaldra","Witch Gate","Addaioth","Vindicus","Zardok","Ladrielle","Drackla Spire","Ironspike"],

		"civilopediaText": [
			{"text": "'We shall strike down our foes with sharp steel and cold hearts. The weak die so that the strong prevail and none shall be spared. Then and only then will our enemies know the true meaning of fear' - Malekith, Witch King of Naggaroth."},
			{"separator": true},
			{"text": "Those are the elves that were driven from the Ulthuan centuries ago, after a horrible civil war. Dark Elves, or Drucchi, as they are known in the Elven tongue, are close kin to High Elves, except for being paler, due to environment of their new, dark and cold home."},
			{"text": "Dark Elves, or Druchii as they call themselves, dwell in the realm of Naggaroth, the Land of Chill, far in the northern part of the New World. From their six menacing fortified cities, they march forth to enslave the free peoples of the Old World. The bulk of the Dark Elf army is made up of Spearmen & Warriors drawn from amongst the citizens of the Dark Elf cities. Sacrifices of blood are made in the name of Malekith the Witch King, and the bodies of slain victims litter the battlefields of their armies."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Skaven
	{
		"name": "Skaven",
		"leaderName": "Skyre",
		"adjective": ["Skaven"],
		"startBias": ["Marsh"],
		"style": "Beastmen",
		"favoredReligion": "Cult of the Horned Rat",
		"outerColor": [181, 101, 29],
		"innerColor": [0, 255, 0],
		
		"declaringWar": "Kill-Kill!",
		"attacked": "Your doom is coming, man-things.",
		"afterPeace": "Yes-yes Warlord - for a treaty-pledge of just 200 Slaves, 12 claws of warptokens, a Breeder and certain alliances and pledges, one of our very-very finest Clan Moulder Rat Ogres can be yours.",
		"defeated": "SKREEE -- address me as.... sleglord.",
		"introduction": "Mik, mik kill things!",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		

		"uniques": ["Starts with [Underworld]",
					"[-20]% enemy spy effectiveness [in all cities]"],
		"cities": ["Skavenblight","Hell Pit","The Black Chasm","Crookback Mountain","Foul Peak","City of Pillars","Queekwell","Bonestash","Fester Spike","Putrid Stump","Under-Altdorf","Under-Delberz","Under-Middenheim","Under-Nuln","Under-Remas","Bitter Stink","Under-Mousillon"],
		"spyNames": ["00Skaven, license to kill-kill","Snikch","Veskit","Felish","Naru","Bahe","Atan","Ndruru","Refaat","Neuth"]

		"civilopediaText": [
			{"text": "The Skaven are a race of evil rat-men who inhabit the underground of the Warhammer world. They gnaw at the roots of civilisation, eternally scheming and preparing for the day when their uncountable hordes will overrun the surface world. The only thing that keeps them in check is the constant internal strife between the clans making up their society, but one day the Grey Seers, who speak for the Horned Rat himself, will unify them and lead them to inevitable victory."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "Spy, spy, spy!"},
			{"text": "In Warhammer Full World map, Skavenblight is surrended by many human or elven nations. Go as fast as possible to create a skaven settler to found Hell Pit wherever possible. Sailing might help you to go beyond the Old World."}
		]
	}
	,
	// Ogre Kingdoms
	{
		"name": "Ogre Kingdoms",
		"leaderName": "Groth Onefinger",
		"adjective": ["Ogres"],
		"favoredReligion": "Gork and Mork",
		"style": "Goblin",
		"outerColor": [216, 119, 0],
		"innerColor": [255,255,255],
		
		"declaringWar": "Lunch time!",
		"attacked": "I’ll feed you your own entrails!",
		"defeated": "*gargl*",
		"afterPeace": "Next time we'll have a meal with you.",
		"introduction": "Hello. We are hungry. Could we have you for dinner?",	
		
		"neutralHello": "You look appetizing.",
		"hateHello": "Grrrr...",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Greenskin]","Comment [Greenskin]",
					"[+10]% Strength <for [{Melee} {Land}] units>", 
					"No movement cost to pillage <for [Land] units>", 
					"[+20]% Strength for cities <when defending>", 
					"Gain [10] Influence with a [Military] gift to a City-State"],
		"cities": ["Goldtooth Tribe","Thunderguts Tribe","Crossed Clubs","Sons of the Mountain","Feastmaster Tribe","Rock Skulls","Blood Guzzler","Ironskin Tribe","Lazarghs","Mountaineater Tribe","Eyebiter Tribe","Fleshgreeders","Sabreskin","Bulgers","Boulderclubs","Loose Tooth","Bloodmaw","Tribe of Shrewd Fulg","Slavetakers","Skulltakers","Bloody Fists","Suneaters","Angry Fist","Red Maw","Red Fist","Boulderbellies"],

		"civilopediaText": [
			{"text": "The Ogre Kingdoms are the rightful and sovereign domains of the large, brutish and always hungry mortal race of humanoids known as Ogres. Wandering tribes of Ogres can be found wrecking their way across the globe, erecting many strongholds and plundering far off and exotic lands the likes of which no man will ever see in their lifetime. Yet no matter how far away they may be, all Ogres refer to the scattered tribal kingdoms that dominate the slopes and river valleys of the Mountains of Mourn their rightful, hard-earned homeland. It is here, amongst the frozen peaks and blistering blizzards that mighty Tyrants rule over their own brutal kingdoms, warring amongst each other, looting, extorting and ransacking all before them as a tribute to their own gluttonous appetite and their ever-hungry god, the Great Maw."},
			{"text": "They fight as thugs, bandits and mercenaries, their hulking numbers coming from a wide diversity of warmongering tribes scattered all across the Mountain range. They pick on the strong and the weak alike, battling mighty foes and powerful kingdoms many thousands of miles away all for the alluring promise of gold, plunder and meat.[2a] Even here, amongst the peaks where they hold claim to all, fearsome beast and mighty creatures dominate the dark corners of their realm, preying on all those who come to close. Yet such is the Ogres ferocious, stubborn and ever ravenous nature that they see these creatures not as a foe to cower and hide from, but as a challenge that needs to be brought down, crushed beneath their boot and eaten to fill their hungry bellies."},
			{"text": "Armies have come and gone throughout the ages into the Mountains, but only the Ogres can truly claim to have conquered it all. It was the Ogres who brought down the mighty Sky-Titans of the upper Peaks, bringing their civilisation low and condemning their children into exile or enslavement.[1f] It is they who once claimed a mighty realm within the Great Steppes of the Far East, battling the ancient Grand Empire of Cathay for supremacy before the day came that their malevolent and ever-hungry God, the Great Maw punished the Ogres for their sins and brought about the Great Migration of their race.[1e] That was many thousands of years ago, and as the Ogres grow in numbers once more, the cycle of history is set to repeat itself. Should nothing stop them now, it is said that the Ogres will stop at nothing to devour every living thing within this ravaged world. "},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Ironclaw Orcs
	{
		"name": "Ironclaw Orcs",
		"leaderName": "Gorbad",
		"adjective": ["Ironclaw Orcs"],
		"favoredReligion": "Gork and Mork",
		"startBias": ["Hills"],
		"style": "Goblin",
		"outerColor": [54, 101, 87],
		"innerColor": [255,255,255],
		
		"declaringWar": "Get da Clans togevva....We’s goin to war!",
		"attacked": "I'm gonna stomp 'em to dust. I'm gonna grind their bones. I'm gonna pile 'em up inna big fire and roast 'em. I'm gonna bash 'eads, break faces and jump up and down on da bits dat are left. An' den I'm gonna get really mean.",
		"defeated": "The only good stunty is a dead stunty, and the only thing better than a dead stunty is a dyin' stunty who tells yer where to find 'is mates.",
		"afterPeace": "Let 'em tell da King. Da east belongs to da Orcs. Da east belongs to Morglum. Da east is green.",
		"introduction": "We's the Orks and you is NOT!",	
		
		"neutralHello": "The future ain't bright. The future is green.",
		"hateHello": "Da Clans will destroy you.",
		"tradeRequest": "Wanna trade or wanna be stomped?",
		

		"uniques": ["Starts with [Greenskin]","Comment [Greenskin]"],
		"cities": ["Iron Rock","Maad Dog Pass","Fire Mountain","Black Fire Pass","Krimson Killerz","Blue Face","White Orcs","White Skullz","Yellow Eye","Red Fangs"],

		"civilopediaText": [
			{"text": "'I'm gonna stomp 'em to dust. I'm gonna grind their bones. I'm gonna pile 'em up inna big fire and roast 'em. I'm gonna bash 'eads, break faces and jump up and down on da bits dat are left. An' den I'm gonna get really mean.' - Grimgor Ironhide, Black Orc Warboss"},
			{"separator": true},
			{"text": "The Orcs aren't a subtle race. They like war and are built for it. Their hugely muscled forms are almost immune to disease and can survive wounds that would be fatal for almost any other race. Couple this with their total disdain for any election campaign more subtle than a severe beating and you have an army of violent monsters led by the biggest and most psychotic of the lot."},
			{"text": "Before Gorbad Ironclaw's rise, the Ironclaw Orcs lived around the Iron Rock for many years, and their fortunes rose and fell with the accustomed regularity of Orc tribes. Their chief rival was the Broken Tooth Tribe, led by the notoriously huge and brutal Crusher Zogoth, who held the former Dwarf hold of Black Crag."},
			{"text": "When Gorbad came to power, he led his tribe to carve out swathes of territory. From their impregnable base, Gorbad sent out warriors to overrun the Worlds Edge Mountains. Gorbad learned to annihilate rival leaders in as horrific and violent a way as possible. This often intimidated the rest of the mobs, who would then rush to join Gorbad's armies. The only powers that stood in the way of the Ironclaw Orcs were the Broken Tooths and the Dwarfs, who still wielded great power near their major strongholds."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Badmoon Goblins
	{
		"name": "Badmoon Goblins",
		"leaderName": "Dork",
		"adjective": ["Goblins"],
		"favoredReligion": "Gork and Mork",
		"startBias": ["Hills","Forest"],
		"style": "Goblin",
		"outerColor": [172,138,19],
		"innerColor": [255,255,255],
		
		"uniques": ["Starts with [Greenskin]","Comment [Greenskin]"],
		"cities": ["Crooked Moon","Moonjaw","Shifties","Red Eye","Burnin’ Face","Da Krawlas","Skull Crag","Yellow Eye","Dog Boyz","Creeping Death"],

		"declaringWar": "I'm gonna bash 'eads, break faces and jump up and down on da bits dat are left.",
		"attacked": "Boss 'o dem night goblins!",
		"defeated": "Let me fink about it.... No!!!",
		"afterPeace": "We'll fink dat over. Or not.",
		"introduction": "We'z Gobbos!!!",	
		
		"neutralHello": "We 'ave small talk.",
		"hateHello": "You're ugly.",
		"tradeRequest": "Goblins offer you dis. Fink fast.",
		

		"civilopediaText": [
			{"text": "In every forest and under every mountain lurk the warlike tribes of Greenskins - countless Orcs and Goblins who love nothing more than a good fight. Orcs and their smaller cousins, the Goblins, are ferocious raiders and relentless warriors whose ceaseless attacks are always threatening to engulf the entire Old World into eternal warfare."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Chaos Dwarves
	{
		"name": "Chaos Dwarfs",
		"leaderName": "Astragoth Ironhand",
		"adjective": ["Chaos Dwarfs"],
		"startBias": ["Tundra"],
		"favoredReligion": "Cult of Hashut",
		"style": "Dwarven",
		"outerColor": [153, 51, 153],
		"innerColor": [255,255,255],

		"startIntroPart1": "'You may curse us, shun us, deny our existence, but that is no matter. You have done so for centuries. Had you not abandoned us, our vast family would never have been sundered. Thanks to your cowardice, we are strong and mighty, seeing the truths that have long been hidden from Dwarf eyes.' - Gakroth, Chaos Dwarf Sorcerer",
		//"startIntroPart2": "...",
		

		"declaringWar": "My youngest Zharrling will be 5 years of age tomorrow, so we're giving him a birthday party for him and 20 of his friends. I'll be needing some slaves for the youngsters to play with as party favors.",
		"attacked": "I will use Hashut's Blood to free me of this curse! Stone will return to flesh and then I shall fashion a throne at the top of Zhar-Naggrund, from which I'll will rule forever in the Great Bull's name.",
		"defeated": "Where was Grimnir when our warriors were dying?",
		"afterPeace": "One day there will be a reckoning and it will be the Sons of the Father of Darkness who will have the victory, not the weak willed spawn of the pathetic Ancestor Gods.",
		"introduction": "We do what we must to survive. We’ve made many concessions and thrown our lots in with the Greenskins, but as their masters, not as slaves. Of course, our values would never have been compromised had it not been for the betrayal of the past.",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Dwarven Ingenuity]",
					"Starts with [Chaos]",
					"Earn [50]% of killed [Dwarfs] unit's [Cost] as [Culture]", // slaver nation
					"When defeating a [Badmoon Goblins] unit, earn [5] Gold and recruit it", 	// greenskin alliance
					"When defeating a [Ironclaw Orcs] unit, earn [5] Gold and recruit it", 		// greenskin alliance
					"Units ignore terrain costs when moving into any tile with Hills",
					"Land units may cross [Mountain] tiles after the first [Great Person] is earned",
					"Comment [Dwarven]"],
		"cities": ["Zharr-Naggrund","Gates of Zharr","Uzkulak","Gorgoth","Daemon's Stump","Black Fortress","Vorag","Gash Kadrak"],

		"civilopediaText": [
			{"text": "The Chaos Dwarfs are the evil rulers of the Dark Lands, a massive bleak region littered with ziggurats and forges that churn out untold tonnes of ashes across the land in the name of industry. They have enslaved numerous races, particularly the Greenskins, and have an alliance with the Hobgoblin Hegemony that more than makes up for their own slow characteristics. "},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Araby
	{
		"name": "Araby",
		"leaderName": "Jaffar",
		"adjective": ["Arabyans"],
		"startBias": ["Desert","Oasis"],
		"style": "Human",
		"personality": "Monarch",
		"outerColor": [255, 255, 0],
		"innerColor": [255,0,0],
		
		"startIntroPart1": "'Find a way with the ships of the desert (camels). Navigate by the stars, and bring back the riches from under the noses of our rivals!' - Sultan of Lashiek to Ibn Jellaba",
		//"startIntroPart2": "...",

		"attacked": "May your souls be flayed by Djinn!",
		"defeated": "Our lives were glorious. Our death is as much. We'll meet in St'oec.",
		"introduction": "By the silver beard of Abdul ibn Ashid! What a surprise to meet you, stranger.",
		"declaringWar": "Al Muktar!",
		"afterPeace": "I will be using my lamp of the Djinn for the next two wishes. Hopefully they will not be against you.",
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		

		"uniques": ["Starts with [Arabyan Tradition]"],
		"cities": ["Lashiek","Copher","Alhaka","Martek","Muktarhin","Bel-Aliad","Bagar","Ka-Sabar","El-Haikk","Zarekten","Gazi","Amhabal","Dakisir","El-Khabbath","Ras Karim","Songhai","Shanidaar"],

		"civilopediaText": [
			{"text": "Araby is an arid region to the south of the Old World, populated by dark-skinned humans who worship a single god. They are known to wield dark powers, and are able to summon powerful spirits known as Djinni"},
			{"text": "Araby is a huge empire composed of many theocratic Caliphates, ruled over by the Sultan of All Araby. Arabyan society is dominated by a religious fundamentalism and is not so technically advanced as that of the Old World. Around 1,000 years ago (in the year 1500, by Old World reckoning), Sultan Daryus-e Qabir launched a series of religious wars against the Old World, without any lasting successes. Legends dating from that time has coloured Old World attitudes to inhabitants of Araby, although there is a fair amount of trade between the two areas."},
			{"text": "The Sultan of All Araby claims the whole Arabyan peninsula as belonging to the Empire of Araby. This claim is hardly a realistic claim. Most of the land is covered by hot deserts and dry shrubland. The population lies largely in the coastal cities or the towns and villages surrounding them. The main feature of the region is the Great Desert of Araby, a vast sea of sand taking up most of the interior of the peninsula. The desert is bordered by dry shrublands from the north-east to the south-west. In the north-west lies the Alzim mountains, a jagged line of rock clawing at the skies. Only on the highest peaks of this mountain-range can snow be found, though few travellers brave the perils of the perils of the mountains far enough to reach it. From these mountains flow the only true river of Araby, the Chewan-el Alzim, Son of Alzim. Rain falls in the mountains, making the lands to the west the most fertile of all Araby. Here are even dense jungles covering the area, known as the Land of Assassins."},
			{"text": "West again, across the Shark Straits lie the fabled Sorcerers' Islands, where legend has it that the mighty Sorcerer Kings once ruled the whole of Araby and the lands beyond. Nothing remains of them except ruins of cities destroyed by some unfathomable cataclysm."},
			{"text": "The coast winds south along the Arabyan Sea before swinging sharply east to the Gulf of Medes. The inner reaches of the gulf marks the end of the Arabyan peninsula, but the gulf is in effect Arabyan territory. The Arabyan outposts along the coast are the gateways to the wealth of the Southlands, and the Arabyan jealously defend what they consider theirs."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Hordes of Chaos
	{
		"name": "Hordes of Chaos",
		"leaderName": "Archaon",
		"adjective": ["Hordes of Chaos"],
		"favoredReligion": "Chaos Gods",
		"preferredVictoryType": "Domination",
		"personality": "Everchosen of Chaos",
		"style": "Demonic",
		"outerColor": [135, 78,51],
		"innerColor": [255,255,255],
		
		"declaringWar": "Fear me mortals, for I am the Anointed, the favoured Son of Chaos, the Scourge of the World. The armies of the gods rally behind me, and it is by my will and by my sword that your weakling nations shall fall.",
		"defeated": "I am the Final Moment made flesh. I stand here on this mountain, and I will sit on this throne. I will be the axis upon which the wheel of change turns, and the world will drown in the light of unborn stars.",
		"attacked": "You're attacking us? It's not the end of the world. Yet.",
		"introduction": "I am Archaon, doom to my enemies, doom to all the world, doom to all the gods invested in that world.",
		"afterPeace": "Peace is not the absence of chaos.",
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		

		"uniques": ["Starts with [Chaos]",
					"[+2 Food, +2 Production] in cities on [Land] tiles <with [1] to [6] neighboring [Snow] tiles>",
					"Enemy [Military] units must spend [1] extra movement points when inside your territory <if [Infernal Gate] is constructed>", 
					"[+1 Happiness] from every [Barracks] <in cities with a [Infernal Gate]>", 
					"[+1 Happiness] from every [Armory] <in cities with a [Infernal Gate]>", 
					"[+1 Happiness] from every [Knight Academy] <in cities with a [Infernal Gate]>", 
					"Gain a free [Black Hole] [in capital]", 
					"Receive a free Great Person at the end of every [comment] (every 394 years), after researching [Corruption of Chaos]. Each bonus person can only be chosen once.",
					"Cannot build [Infantry Hero] units", 
					"Cannot build [Anti-Cav Hero] units", 
					"Cannot build [Cavalry Hero] units", 
					"Cannot build [Archery Hero] units", 
					"Cannot build [Siege Hero] units", 
					"Cannot build [Water Hero] units", 
					"Cannot build [Melee Water Hero] units", 
					"May buy [Archdemon Kor'vash] units for [0] [Faith] [in all cities] at an increasing price ([100]) <starting from the [Age of Magic]>"],
		"cities": ["Inevitable City","Bastion Stair","Ebon Keep","Sands of Time","Horrorsong","Daemon Statue","Hatemarch","Strangled Gasp","Gaping Dark","Zerulous","Infernius","Black Rock","Shifting Monolith","Twisted Towers"],

		"civilopediaText": [
			{"text": "In the cold wastes of the north, the followers of the gods of Chaos gather in their thousands. Hordes of barbaric marauders and armour-clad warriors pour forth from the bleak wastelands to wage war against the soft-bellied wastrels who inhabit the rich lands of the south. Daemonic legions advance with them, proof that the Northmen are truly the favoured of the gods. There can be no bystanders in this eternal war, for the Dark Gods and their chosen servants will never rest until the world truly becomes a Realm of Chaos. "},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Kurgan
	{
		"name": "Kurgan",
		"leaderName": "Kurgan",
		"adjective": ["Kurgan"],
		"startBias": ["Tundra"],
		"preferredVictoryType": "Domination",
		"style": "Human",
		"outerColor": [162, 51, 51],
		"innerColor": [255,255,255],
		
		"declaringWar": "We are the prophets, we are the servants, we are the warriors of Tchar, and we will destroy you.",
		"attacked": "Don't you know thatt it is better to take your own life than to fall into the hands of the Kurgan?",
		"defeated": "Everything has an end. We had so much fun pillaging the temples and the shrines and slaying the Priests and virgins.",
		"afterPeace": "There is nothing if there isn't war",
		"introduction": "You may call us heathens, savages or even brutes, but we are closest to the gods. We see their work in all things. And we do not create new, seemly gods to conform with our hopes for the world.",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Chaos]"],
		"cities": ["Khorinaun","Vorshgar","Karrannazzarr","Ulangor","Ananar","Dair","Phuuunnar","Querz","Ulauch","Foldh","Zanar","Hleoch","Dubhz","Dadeeh","Rhandh","Quuff   Ooar","Irtlak","Daaoaath","Akuaaeugg","Nnuuooo","Euiar","Dathzhulda","Zhuush","Daduak","Chakir","Therabl","Hhuuak","Ilph","Qooerde","Uugz","Zzhir","Iraocogyybh   Gzchabl","Qdai","Owablir","Duanil","Eranisshhabl","Ildherooer","Zaoulaa","Dhul"],

		"civilopediaText": [
			{"text": "The Kurgan are mighty, nomadic, copper-skinned Human horse-warriors who dwell under the shadow of Chaos, in the vast Eastern Steppes that border the Chaos Wastes of the north."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Beastmen
	{
		"name": "Beastmen",
		"leaderName": "Greysnarl",
		"adjective": ["Beastmen"],
		"startBias": ["Forest","Jungle"],
		"personality": "Jungle Emperor",
		"style": "Beastmen",
		"favoredReligion": "Chaos Gods",
		"preferredVictoryType": "Domination",
		"outerColor": [135, 78,51],
		"innerColor": [255,255,255],
		
		"declaringWar": "We fight, we kill, one day we win. One day soon!",
		"attacked": "You -- if you lucky, we eat you, make you into part of us, make you better than you, stronger than any of you, stronger than all of you.",
		"defeated": "I am the Final Moment made flesh. I stand here on this mountain, and I will sit on this throne. I will be the axis upon which the wheel of change turns, and the world will drown in the light of unborn stars.",
		"afterPeace": "Horde come back soon.",
		"introduction": "Tduigu-Uis.",
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		

		"uniqueName": "Rage of the Beast",
		"uniques": ["Starts with [Chaos]",
					"[+50]% Golden Age length", 
					"[+10]% Strength <for [All] units> <during a Golden Age>", 
					"[+15]% [Science] <during a Golden Age>", 
					"Gain a free [Sulong's Training] [in capital] <after discovering [Bronze Working]>"],
		"cities": ["Akhash","Gorthor","Tzeen","Shaabhekh","Slaa","Khar","Fuib"],

		"civilopediaText": [
			{"text": "Deep within the dark and twisted forests dwell countless horrifying and deadly creatures – tainted beasts warped by Chaos. The Beastmen are a plague on the civilised races, preying on the weak and striking without warning in a rampage of killing and destruction before disappearing into the protective darkness of the wilderness. All manner of mutated and blood-hungry creatures join these raids – towering, nightmarish beasts whose whole existence centres on the rush of blood that comes during the slaughter."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Lizardmen (Slann)
	{
		"name": "Slann",
		"leaderName": "Kroak",
		"adjective": ["Lizardmen"],
		"startBias": ["Jungle"],
		"personality": "Ancient Prophet",
		"style": "Lizardmen",
		"favoredReligion": "The Old Ones",
		"outerColor": [0, 139, 139],
		"innerColor": [0,0,0],
		
		"declaringWar": "The Warm-bloods dare to meddle at the Fallen Gates. The Great Purpose does not allow for mercy!",
		"attacked": "At the time of the three hundredth cycle of this world, the two moons shall unite and summon forth the Rodent God and his evil spawn to deliver plague and pestilence upon the land named Lustria.",
		"defeated": "Amid the darkness and horror of a world splintering apart, the armies of the true creators, we who were ancient at the dawn of time, won't march forth once more.",
		"afterPeace": "There are many paths to order and knowledge; may the Old Ones guide us",
		"introduction": "Kroak! Who are you?",

		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Cold Ones]"],
		"cities": ["Itza","Hexoatl","Tlaxtlan","Xlanhuapec","Axlotl","Huatl","Oyxl","Zlatlan","Pahuax","Tlanxla","Xahutec","Tlax","Chaqua","Quetza","Xhotl","Chupayotl","Spektazuma","Hualotl","Qu'ittax","Subatuun","Kaiax","Xlanzec, the City of Outsiders"],

		"civilopediaText": [
			{"text": "The Lizardmen are an ancient race, created by the god-like beings known as the Old Ones to be the guardians of the Warhammer world. Their age-old civilization is based deep within the steaming jungles of Lustria and the Southlands, where their mighty temple-cities rise amid the ancient trees and cloying swamps. The bloated Slann Mage-Priests are masters of magic and the original servants of the Old Ones, and it is they who oversee the entire Lizardmen civilization, guiding it forwards. At the heart of the Lizardmen armies are the powerful Saurus, hulking reptilian warriors spawned solely for the purpose of war. They are revered as sacred warriors of the gods, and each temple-city has an army of them dwelling beneath the temples, ever ready to march against their foes."},
			{"text": "In ages past, the Old Ones departed the world in an event of catastrophic consequence, known as the Fall, that dramatically altered the world and stranded their servants alone there. Without the guidance of their creator-gods, the Slann work to interpret the Great Plan that their masters were working towards and attempt to continue the cause, restoring the order that was present before the coming of Chaos. With cold, alien indifference, the Slann guide their armies towards the fulfillment of this plan, and mercilessly punish any who stand in the way of their sacred mission. "},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Amazonia
	{
		"name": "Amazonia",
		"leaderName": "Penthesilea",
		"outerColor": [144, 238, 144],
		"innerColor": [75, 0, 130],
		"adjective": ["Amazons"],
		"startBias": ["Jungle"],
		"style": "Human",

		"declaringWar": "I am the hunter and you are my prey.",
		"attacked": "We will defend the sacred sites to the last blood.",
		"defeated": "Men, men, men.",
		"afterPeace": "you'll have to clean this up. We won't do it for you.",
		"introduction": "Oh. First men since Rothnikson. Welcome to the Sisterhood.",
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		

		"uniques": ["Starts with [Forest Mastery]"],
		"cities": ["Genaina","Tlaxtlan settlement","Xahutec settlement","Tlax settlement","Huatl settlement","Quetza settlement","Axlotl settlement","Itza settlement","Chaqua settlement","Pahuax settlement","Hexoatl settlement"],

		"civilopediaText": [
			{"text": "The Amazons are the most significant inhabitants of Lustrian jungles after the Slann. It is not known whether they are another experiment of the Old Slann, or as one of the myths says, that they are daughters of Valkyries left there centuries ago, after Norsemen's unsuccessful attempt to colonise Lustria."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Albion
	{
		"name": "Albion",
		"leaderName": "Agam Rund",
		"adjective": ["Albioners"],
		"startBias": ["Coast"],
		"preferredVictoryType": "Cultural",
		"personality": "Monarch",
		"style": "Human",
		"outerColor": [79,120,79]
		"innerColor": [222,198,108],
		
		"declaringWar": "Defend the weak who cannot defend themselves, against any and all unlawful oppressors.",
		"attacked": "Bravely bear arms for Albion against its enemies, under the command of its king and his appointed generals.",
		"afterPeace": "Commandment Ten, you will be courteous and mild even with those you do not love, and will resist all wrath which is not righteous",
		"defeated": "We're vanishing, but remember: stand firm against the temptations of Daemons of Chaos and all Dark Magic.",
		"introduction": "Do respect the Commandments of the Code of Agam Rund.",
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		

		"uniques": ["Starts with [Channeling]"],
		"cities": ["Winwood","Runsinane","Castle McEwman"],

		"civilopediaText": [
			{"text": "The great island of Albion is situated between the Sea of Claws and the Middle Sea. It is a land shrouded by myths and mists, and the scholars of the Old World always write in their maps about Albion 'Here Be Dragons' with bold red letters..."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Ind
	{
		"name": "Ind",
		"leaderName": "Akabar",
		"outerColor": [153, 50, 204],
		"innerColor": [255,255,255],
		"adjective": ["Indics"],
		"startBias": ["Jungle"],
		"style": "Human",
		
		"declaringWar": "By the eight arms of the Great Tiger! Die!",
		"attacked": "Seems you don't know our gods very well. You're underestimating the power of She’ar Khawn.",
		"defeated": "I guess it was our karma.",
		"afterPeace": "Together, let's please our thousand gods!",
		"introduction": "I salute the divine in you. Will you trade with us?",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Arabyan Tradition]"],
		"cities": ["City of Spires","Delehi","Culicuta","Cindraprashta","City of Tor Elasor","Sakali","Mahanaga","Shambani Foothills","Dwaraka","Janasthana","Purushapura","The Eye of the Tiger","Bhojapur","Kusavati","Ayodhya","Kosala","Tower of Stars","Tower of the Sun"],

		"civilopediaText": [
			{"text": "Kingdoms of Ind lie on a large peninsula between Imperial Cathay and the Darklands. The area is covered by dense primordial forest with occasional spots of dry land. The Mogul kings of Inja are brutal despots, full of greed for power and gold. Among people they are worshipped like gods. Indic elite infantry consist of the strongest men taken by the kings and trained into beasts. The Ind are said to worship One Thousand and One Gods in total."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Grand Cathay
	{
		"name": "Cathay",
		"leaderName": "Wu",
		"adjective": ["Cathayans"],
		"style": "Human",
		"personality": "Harmonious Warchief",
		"outerColor": [255, 192, 203],
		"innerColor": [75, 0, 130],
		
		"declaringWar": "...",
		"attacked": "...",
		"defeated": "...",
		"afterPeace": "Living in harmony is all that our people desire.",
		"introduction": "...",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Far East]"],
		"cities": ["Weijin","Nan-Gau","Shang-Yang","Shang Wu","Fu-Chow","Fu-Hung","Nan Chu","Heyang","Wang","Shuang Hsi"],

		"civilopediaText": [
			{"text": "Imperial Cathay is known for its immerse size, unified priesthood and omnipresent bureaucracy."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Nippon
	{
		"name": "Nippon",
		"leaderName": "Takagura",
		"outerColor": [135, 145, 155],
		"innerColor": [255,255,255],
		"adjective": ["Nipponese"],
		"startBias": ["Coast"],
		"style": "Human",
		"personality": "Monarch",
		
		"declaringWar": "Even monkeys sometimes fall from the trees.",
		"attacked": "What a lack of honour. So despictable.",
		"defeated": "Always know that you know nothing.",
		"afterPeace": "Victory is ever in your grasp – even if you fail to achieve it.",
		"introduction": "We bow to you. Will you fill the purses of our merchants or will you feed the blades of our samurai?",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Far East]"],
		"cities": ["Tokaguchi","Hyudo","Makudo","Kiroshima","Tokaido","Kumano","Izumo","Okakama","Kumayama","Yamanashi","Shoto","Sado"],

		"civilopediaText": [
			{"text": "Thousands of miles away from the Old World lies the island of Nippon, also known as the Land of the Rising Sun. The theoretical head of Nippon is the Emperor Takagura but far more powerful is the Shogun Yoritomo Ieysau, the country's military dictator. The Shogun came to power by defeating his rivals (with no small help from Marienburg guns) and overthrowing the puppet shogunate backed by the Emperor. Now Yoritomo rules the land with an iron grip and enforces strict edicts which forbid the lower classes from carrying weapons and ensures the obedience of the various provincial rulers or daimyo through the use of a complex network of spies as well as holding their wives and children in the capital city every two years. Nippon is the home of the warrior caste known as samurai, the highest rank of nobility in the land. They owe their allegiance to their master through pain of death. Then there are the martial artists and the sinister ninja."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	/*
	,
	// Hobgobelins
	{
		"name": "Hobgobelins",
		"leaderName": "Caledor",
		"adjective": ["Hobgobelins"],
		"favoredReligion": "Gork and Mork",
		"style": "Goblin",
		"outerColor": [105, 34,0]
		"innerColor": [0,0,0],
		
		"declaringWar": "...",
		"attacked": "...",
		"defeated": "...",
		"afterPeace": "...",
		"introduction": "...",	
		
		"neutralHello": "You have my gratitude.",
		"hateHello": "Shame on you.",
		"tradeRequest": "I offers you this exceptional proposition.",
		
		"uniques": ["Starts with [Greenskin]","Starts with [Chaos]"],
		"cities": ["",""],

		"civilopediaText": [
			{"text": ""},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	
*/
	
// City-States
	{
		"name": "The Moot",
		"adjective": ["Halflings"],
		"cityStateType": "Mercantile-Moot",
		"style": "Human",
		"uniques": ["Free [Spearman] appears <upon discovering [Bronze Working] technology>"],
		
		"declaringWar": "You leave us no choice. War it must be.",
		"attacked": "Very well, this shall not be forgotten.",
		"defeated": "You fiend! History shall remember this!",
		"outerColor": [ 20, 20, 20],
		"innerColor": [255,153,255],
		"cities": ["The Moot"],
		"civilopediaText": [
			{"text": "The Moot or the Mootland is an autonomous region governed by Halflings located between Averland and Stirland. Administrative autonomy was granted to the little folk by Ludwig the Fat in 1000 IC, during the Age of Three Emperors, after he decided it was about time to give them their own land to govern as they see fit. Ludwig's advisers at the time told him that he cannot possibly grant the Halflings this just because they had contributed to the Imperial cuisine. Nevertheless, Ludwig the Fat issued the edict that the Moot should be its own province and even be permitted an electoral vote (much to the consternation of his more conservative advisers.)"},
			{"text": "The Moot is formed by a collection of villages, each one headed by an Elder. The Elders meet fairly frequently, called a District Moot, in a selected village which has been voted for by the Elders; such things as prestige and monthly yield is important in the voting process. Topics debated in a District Moot covers the harvest, which is one of the most important areas of discussion, how many fields should be left fallow, if any are flooded, as well as other crop rotation and fertility issues; where herds should be allowed to graze, if they are producing enough milk or not; whether the cheese is up to standard; the amount of pipe weed grown; and if there are any concerns over possible bandit activity. Before the District Moot the chair-halfling is elected by the Elders and this individual actually becomes an Imperial Elector with the power to vote for a new Emperor!"},
			{"text": " District Moot is a sight to behold for it is a gigantic banquet where the village Elders smoke enormous amounts of pipe weed and drink ale by the gallon. For some Elders the attendance of a District Moot depends on the size of the banquet and what is being served. Some conservative Elders (those with strong Halfling traditions) will baulk if half a dozen extra helpings of meat pie are not forthcoming and won't attend. Often the local Electors, usually Averland and Stirland, will send emissaries to a District Moot to watch and take note of the proceedings (when politics is finally discussed after the first seven courses) because little do the Halflings know that they could have an influential say on Imperial politics. One of the Emperor's own Plenipotentiaries is always present at any District Moot, as whoever becomes an Imperial Elector from the assembled Halflings could prove to be an important associate and ally. The Emperor's Plenipotentiary will also keep an eye on any other officials sent by the Electors."},
			{"text": "Although the Moot relies heavily on Imperial protection it does at least have its own militia, which the Count of Stirland in particular insists upon, to help with combating bandits in the region. Mostly they are a defensive force and not very well equipped to attack. The Halflings make great use of their culinary skills for homeland defence. Just as most Halflings are excellent cooks and can prepare delicious meals some can also prepare cocktails designed to actually harm a foe and even these ingredients are closely guarded secrets just like an old woman won't divulge the secrets of her recipe book. The cocktails are boiled by the cauldron load and contain ferociously hot spices, as well as peppermint herbs, firebalm, and even dabs of gunpowder. The mixture turns out to be quite a wicked brew and highly flammable, not to mention effective when launched from a catapult. Indeed, mixtures of this kind are very effective against goblinoids; apparently the hot spices and herbs play merry havoc with their fungus-like metabolism. This could be one of the reasons why bands of goblinoids aren't as much of a problem as perhaps they should be on the Moot's borders; the stench given off by the boiling brew is enough to put most creatures off from getting too close. This lethal, stinking concoction is reasonably harmless to a Halfling should one consume a portion (he or she may suffer from an hour or two of stomach pains and intermittent blasts of wind) but to a human it is far more unpleasant; this includes almost immediate unconsciousness and at least two weeks, or more, of diarrhoea."},
			{"text": "In return for their Imperial vote, the Moot sends some of their finest cooks to the Imperial court and sends small groups of their foresters to serve for a time in the Imperial army. Halflings are not born warriors but they make competent bowmen and can make hardly a sound when wandering through undergrowth. This makes them ideal scouts although their use in any Imperial army is largely symbolic and few Empire generals want them in their army. Halflings in defence of their homes are determined and doughty fighters, however."}
		]
	}
	,
	// Dolgans
	{
		"name": "Dolgan",
		"adjective": ["Dolgans"],
		"cityStateType": "Militaristic",
		"style": "Human",
		"uniques": ["Free [Luan] appears <upon discovering [Military Science] technology>"],

		"declaringWar": "You leave us no choice. War it must be.",
		"attacked": "Very well, this shall not be forgotten.",
		"defeated": "What a fine battle! Dolgan is willing to serve you!",
		"outerColor": [ 20, 20,20],
		"innerColor": [255,255,255],
		"cities": ["Dolgan"],
		"civilopediaText": [
			{"text": "Dolgans represent the barbarian tribes dwelling in the tundra east of Kislev (they come from the same Gospodar culture). Dolgans spend most of their life on horseback, that is why their horse archers are valued all over the Old World, often hired by kislevite or imperial generals. Unlike most barbarian tribes, Dolgans are not chaotic, though the proximity to Chaos Wastes makes them vulnerable victims."}
		]
	}
	,
	// Marienburg
	{
		"name": "Marienburg",
		"adjective": ["Marienburgers"],
		"cityStateType": "Mercantile",
		"style": "Human",
		"uniques": ["Starts with [Sailing]"],

		"declaringWar": "You have revealed your purposes a bit too early, my friend...",
		"attacked": "Very well, this shall not be forgotten.",
		"defeated": "They will write songs of this.... pray that they shall be in your favor.",
		"outerColor": [20, 20,20],
		"innerColor": [255,255,255],
		"cities": ["Marienburg"],
		"civilopediaText": [
			{"text": "'The business of Marienburg, is business.' —Director Jaan van de Kuypers of Marienburg"}
		]
	}
	,
	// Lahmia
	{
		"name": "Lahmia",
		"adjective": ["Lahmians"],
		"cityStateType": "Mercantile-Lahmian",
		"style": "Human",
		"uniques": ["Starts with [Undead Curse]"],
		
		"declaringWar": "You leave us no choice. War it must be.",
		"attacked": "Very well, this shall not be forgotten.",
		"defeated": "Unacceptable!",
		"outerColor": [ 20, 20, 20],
		"innerColor": [255,255,255],
		"cities": ["Lahmia"],
		"civilopediaText": [
			{"text": "Lahmia, once known as the strange and decadent 'City of the Dawn', today as 'The Cursed City', was an ancient city-state of the great Human realm of Nehekhara, now called the Land of the Dead"}
		]
	}
	,
	// Free City of Sartosa
	{
		"name": "Sartosa",
		"adjective": ["Pirates"],
		"cityStateType": "Militaristic",
		"startBias": ["Coast"],
		"uniques": ["[+1] Movement <for [{Military} {Water}] units>"],

		"declaringWar": "Do you really think you can walk over us so easily? I will not let it happen. Not to my people!",
		"attacked": "We are no strangers to war.",
		"defeated": "You are nothing but a glorified barbarian. Cruel, and ruthless.",
		"outerColor": [ 20, 20, 20],
		"innerColor": [255,255,255],
		"cities": ["Sartosa"]
	}
	,
	// Zombie Pirates
	{
		"name": "Zombie Pirates",
		"adjective": ["Zombies"],
		"cityStateType": "Militaristic",
		"style": "Demonic",
		"startBias": ["Coast"],
		"uniques": ["[+1] Movement <for [{Military} {Melee}] units> <in [{Marsh}] tiles>"],

		"declaringWar": "Do you really think you can walk over us so easily? I will not let it happen. Not to my people!",
		"attacked": "We are no strangers to war.",
		"defeated": "You are nothing but a glorified barbarian. Cruel, and ruthless.",
		"outerColor": [ 20, 20, 20],
		"innerColor": [255,255,255],
		"cities": ["Vampire Coast"]
	}
	,
	// Citadel of Dusk
	{
		"name": "Citadel of Dusk",
		"adjective": ["Pirates"],
		"cityStateType": "Militaristic",
		"style": "Elven",
		"startBias": ["Coast"],
		"uniques": ["[+1] Sight <for [{Military} {Water}] units>"],

		"declaringWar": "Do you really think you can walk over us so easily? I will not let it happen. Not to my people!",
		"attacked": "We are no strangers to war.",
		"defeated": "You are nothing but a glorified barbarian. Cruel, and ruthless.",
		"outerColor": [ 20, 20, 20],
		"innerColor": [255,255,255],
		"cities": ["Citadel of Dusk"]
	}
		
	/*
	,
	// Border Princes: Citadelle Bouelia
	{
		
	}
	,
	// Border Princes: Matorea
	{
		
	}
	,
	// Hung
	{
		"name": "Hung",
		"leaderName": "Bjarke Black Raider",
		"outerColor": [105, 34,0]
		"innerColor": [0,0,0],
		"adjective": ["Hung"],
		"startBias": ["Tundra"],
		"style": "Human",
		
		"uniques": ["Starts with [Far East]"],
		"cities": ["Aghols","Chi-An","Dreaded Wo","Kuj","Man-Chu","Mung","Tu-Ka","Wei-Tu","Yin"],

		"civilopediaText": [
			{"text": ""},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}
	,
	// Ungols
	{
		"name": "Ungols",
		"leaderName": "Toghrul",
		"adjective": ["Ungols"],
		"startBias": ["Tundra"],
		"style": "Human",
		"outerColor": [105, 34,0]
		"innerColor": [0,0,0],
		
		"uniques": ["Starts with [Far East]"],
		"cities": ["Norvard",""],

		"civilopediaText": [
			{"text": "Ungols are the riders of Northern Steppes. The Ungol horde conquered Kislev and Ostland (a part of The Empire), but was later assimilated into Gospodar culture."},
			{"separator": true},
			{"text": "The Ungols or Unkhol, are the nomadic people who make up the Ungol Empire.  This Empire spans the steppes of the Far East, and is the largest Empire to exist to date.  It's borders start to the West at the Hobgoblin Hegemony and the Mountains of Mourn, North to the frozen tundra and uninhabited forests, to the borders of Imperial Cathay, held off by the Emperor's Wall, to the South of the Kamalayan Mountains and the princes of Ind."},
			{"text": "They are a tough and enduring people, battling not only their environment, but their enemies, to the East, South, and West. They believe that one day, the Great Khan will return, and lead them to final victory, when the world will be theirs. Their armies are the most seasoned and maneuverable in the world. If it wasn't for the Chaos Dwarf Citadels and their Hobgoblin servants to the West, and Imperial Cathay to the East, they would be unstoppable.  But between two numerous enemies, to each side, has hindered their greater ambition."},
			{"text": "Despite their massive Empire, the culture is a nomadic one, with dispersed populations.  The men herd cattle, sheep, and goats, while the women cook and maintain the household. They were organized around a traditional tribal and clan order, but with the rise of the Khans, this has changed."},
			{"text": "The Ungols are loyal to each other, and often adopt special relationships. A man is defined by his relationships with his friends, while a wife is defined by her role in the husband's household."},
			{"text": "The Ungol are mounted archers, riding fast steeds, and firing torrents of barbed arrows at their enemy, but never close enough to engage in melee combat. They are unparalleled horseman, and masters of the bow. The Dolgans are closely related to the Ungols."},
			{"separator": true},
			{"text": "Tips to play:"},
			{"text": "..."},
			{"text": "..."}
		]
	}

	*/
]
